## Import Libraries

In [3]:
import pandas as pd
import re

## Create a Dataframe with raw continuous column string values.

In [22]:
rawdata = {'data': ['2018-01-01 35 20736.87      Paul',
                    '2017-06-15 67 10567.70      Harry',
                    '2015-07-23 01 3873.90      Noel',
                    '2011-05-12 56 82320.65      John',
                    '2010-03-26 21 28737.01      Sally',
                    '2016-08-19 82 80327.63      Mary',
                    '2018-08-12 90 30467.92     Steve']}
dataf = pd.DataFrame(rawdata, columns = ['data'])
dataf

                                data
0   2018-01-01 35 20736.87      Paul
1  2017-06-15 67 10567.70      Harry
2    2015-07-23 01 3873.90      Noel
3   2011-05-12 56 82320.65      John
4  2010-03-26 21 28737.01      Sally
5   2016-08-19 82 80327.63      Mary
6   2018-08-12 90 30467.92     Steve

## Extract Employee Name from the row string

In [23]:
dataf['Emp_Name'] = dataf['data'].str.extract('([A-Z]\w{0,})', expand = True)
dataf['Emp_Name']

0     Paul
1    Harry
2     Noel
3     John
4    Sally
5     Mary
6    Steve
Name: Emp_Name, dtype: object

## Extract Salary from the row string

In [24]:
dataf['Salary'] = dataf['data'].str.extract('(\d\d\d\d\d.\d\d)', expand = True)
dataf['Salary']

0    20736.87
1    10567.70
2         NaN
3    82320.65
4    28737.01
5    80327.63
6    30467.92
Name: Salary, dtype: object

## Extract Data of Joining from the row string

In [25]:
dataf['DOJ'] = dataf['data'].str.extract('(....-..-..)', expand = True)
dataf['DOJ']

0    2018-01-01
1    2017-06-15
2    2015-07-23
3    2011-05-12
4    2010-03-26
5    2016-08-19
6    2018-08-12
Name: DOJ, dtype: object

In [27]:
dataf

                                data Emp_Name    Salary         DOJ
0   2018-01-01 35 20736.87      Paul     Paul  20736.87  2018-01-01
1  2017-06-15 67 10567.70      Harry    Harry  10567.70  2017-06-15
2    2015-07-23 01 3873.90      Noel     Noel       NaN  2015-07-23
3   2011-05-12 56 82320.65      John     John  82320.65  2011-05-12
4  2010-03-26 21 28737.01      Sally    Sally  28737.01  2010-03-26
5   2016-08-19 82 80327.63      Mary     Mary  80327.63  2016-08-19
6   2018-08-12 90 30467.92     Steve    Steve  30467.92  2018-08-12